{
    "arduino": {
        "title": "¿Qué es Arduino?",
        "data": "Arduino es una plataforma de desarrollo de hardware y software de código abierto que permite crear proyectos interactivos. Consiste en una placa electrónica programable que utiliza un microcontrolador y un entorno de desarrollo integrado (IDE) para escribir y cargar programas en la placa.",
        "programming_languaje": "El lenguaje de programación utilizado en Arduino se basa en C/C++, y el entorno de desarrollo proporciona una interfaz gráfica amigable para escribir, compilar y cargar los programas en la placa. Arduino es popular en el ámbito de la electrónica y la robótica, y se utiliza en una amplia gama de aplicaciones, desde proyectos simples de automatización del hogar hasta sistemas complejos de control y monitoreo.",
        "placas": [
            "Arduino Uno r3",
            "Arduino DUE",
            "Arduino Leonardo",
            "Arduino Mega 2560",
            "Arduino Mega ADK",
            "Arduino Micro",
            "Arduino Nano",
            "Arduino YUN",
            "Arduino FIO",
            "Arduino 101 o Genuino 101",
            "Arduino Esplora",
            "Arduino Zero",
            "Arduino MKR Zero",
            "Arduino Ethernet",
            "Arduino Industrial 101",
            "Arduino MKR FOX 1200",
            "Arduino MKR WAN 1300",
            "Arduino MKR GSM 1400",
            "Arduino MKR Wifi 1010",
            "Arduino Uno Wifi REV2",
            "Arduino MKR NB 1500",
            "Arduino MKR Vidor 4000",
            "Arduino MKR 1000 Wifi",
            "Lilypad Arduino Simple",
            "Lilypad Arduino Main Board",
            "Lylipad Arduino USB",
            "Lilypad Arduino Simple Snap"
        ],
        "IDE": [
            "El Arduino IDE (Integrated Development Environment, Entorno de Desarrollo Integrado de Arduino) es un software gratuito y de código abierto utilizado para programar placas de desarrollo basadas en la plataforma Arduino. Es una herramienta diseñada específicamente para facilitar la programación y el desarrollo de proyectos con Arduino.",
            "El Arduino IDE proporciona una interfaz de usuario simple y fácil de usar que permite escribir, compilar y cargar el código en las placas de Arduino. Incluye un editor de texto en el que se puede escribir el código en el lenguaje de programación de Arduino (una variante simplificada de C++), y cuenta con una serie de características que facilitan el proceso de desarrollo, como resaltado de sintaxis, autocompletado y verificación de errores.",
            "Además de su funcionalidad básica de programación, el Arduino IDE ofrece una biblioteca estándar de funciones y ejemplos que pueden ser utilizados para desarrollar una amplia gama de proyectos. También es compatible con una gran cantidad de placas de Arduino y otros microcontroladores compatibles, lo que lo convierte en una opción popular para la comunidad de desarrollo de Arduino.",
            "El Arduino IDE es multiplataforma y está disponible para Windows, macOS y Linux, lo que permite a los usuarios de diferentes sistemas operativos utilizarlo de manera conveniente."
        ],
        "simuladores": {
            "Tinkercad": {
                "title": "Tinkercad",
                "description": "Tinkercad es ampliamente utilizado en entornos educativos, ya que ofrece una forma accesible y visualmente atractiva de introducir a los estudiantes en conceptos de electrónica, programación y diseño. También es utilizado por aficionados y entusiastas de la electrónica para prototipar y experimentar con ideas de proyectos antes de llevarlos al mundo real.",
                "url": "https://www.tinkercad.com/"
            },
            "Wokwi": {
                "title": "Wokwi",
                "description": "Wokwi proporciona una amplia variedad de herramientas de simulación y emulación para varios dispositivos y componentes electrónicos, como microcontroladores, Arduino, Raspberry Pi, sensores, actuadores y muchos más. Los usuarios pueden diseñar circuitos, escribir y probar código, y simular el funcionamiento de sus proyectos en un entorno virtual.",
                "url": "https://wokwi.com/"
            }
        }
    },
    "esp32": {
        "title": "¿Qué es Esp32?",
        "data": "El ESP32 está basado en un microprocesador de doble núcleo Tensilica Xtensa LX6 con frecuencias de reloj de hasta 240 MHz. Cuenta con una amplia gama de características y periféricos, lo que lo convierte en una opción popular para el desarrollo de proyectos IoT. ",
        "programming_languaje": "El ESP32 es compatible con el entorno de desarrollo Arduino, lo que facilita la programación y el desarrollo de proyectos utilizando el lenguaje de programación de Arduino."
    }
}